Step_3_scripts_and_AMR/small_jet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    jet_inlet
    {
        type            turbulentInlet;
    	referenceField  uniform (1.6 0 0);
    	fluctuationScale (0.02 0.01 0.01);
        value           uniform (1.6 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
    	value           $internalField;
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    inlet
    {
        type            noSlip;
    }

    wall_inlet
    {
        type            noSlip;
    }

    "(left_side|right_side)"
    {
        type            pressureInletOutletVelocity;
    	value           $internalField;
    }
}

// ************************************************************************* //
