Step_3_scripts_and_AMR/small_jet/0/s
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      sca;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    jet_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    "(left_side|right_side|outlet)"
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    "(inlet|wall_inlet|top|bottom)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //

